//*****************************Copyright(c)************************************* 
//** 公      司：         AMAE 
//** 项      目：         ADS130    
//** 硬件版本号：       
//**================================================================== 
//**------------------------------------ 文件信息-------------------------------
//** 文  件 名:      iic.h
//** 文件 描述:      iic通讯接口
//** 版     本:      v0.1
//** 创  建 人:      苏琴
//** 创建 日期:      2012.8.29
//**============================================================================
//头文件
//=============================================================================

#ifndef _IIC_H
#define _IIC_H

//==============================================================================
//函数名称：void init_IIC(void)
//输入参数：void
//输出参数：void
//功能说明：iic初始化
//调用位置：main
//备   注：
//============================================================================
void init_IIC(void);

//==============================================================================
//函数名称：void iic_SendByte(unsigned int data)
//输入参数：void
//输出参数：void
//功能说明：iic发送数据
//调用位置：main
//备   注：
//============================================================================
void iic_SendByte(unsigned char data);
//==============================================================================
//函数名称：void iic_SendByte(unsigned int data)
//输入参数：void
//输出参数：void
//功能说明：iic发送数据
//调用位置：main
//备   注：
//============================================================================
 unsigned char iic_RcvByte(void);
 
 //==============================================================================
//函数名称：int writeByte(int addr, char data)
//输入参数：addr：地址 data：写入数据
//输出参数：0：写失败  非0：写成功
//功能说明：写单个字节数据
//调用位置：main
//备   注：
//============================================================================
int writeByte(int addr, unsigned char data);
//==============================================================================
//函数名称：int writeByte(int addr, unsigned int data)
//输入参数：addr：地址 data：写入数据
//输出参数：0：写失败  非0：写成功
//功能说明：写单个字数据
//调用位置：main
//备   注：
//============================================================================
int writeWord(int addr,unsigned int data);

//==============================================================================
//函数名称：int writeByte(int addr, char data)
//输入参数：addr：地址 data：写入数据
//输出参数：0：写失败  非0：写成功
//功能说明：写单个字数据
//调用位置：main
//备   注：
//============================================================================
int writeDWord(int addr,unsigned long data);

//==============================================================================
//函数名称：int writeByte(int addr, char data)
//输入参数：addr：地址 data：写入数据
//输出参数：0：写失败  非0：写成功
//功能说明：写单个字节数据
//调用位置：main
//备   注：
//============================================================================
int writeArrayData(int addr,unsigned char *data,int length);

//==============================================================================
//函数名称：int readByte(int addr, char *data)
//输入参数：addr :读取的地址  *data 读取数据存放地址
//输出参数：0：失败 1：成功
//功能说明：读取单个字节数据
//调用位置：main
//备   注：
//============================================================================
int readByte(int addr,unsigned char *data);
//==============================================================================
//函数名称：int readByte(int addr, char *data)
//输入参数：addr :读取的地址  *data 读取数据存放地址
//输出参数：0：失败 1：成功
//功能说明：读取单个字节数据
//调用位置：main
//备   注：先写从机地址 
//============================================================================
int readWord(int addr,unsigned  int *data);
//==============================================================================
//函数名称：int readByte(int addr, char *data)
//输入参数：addr :读取的地址  *data 读取数据存放地址
//输出参数：0：失败 1：成功
//功能说明：读取单个字节数据
//调用位置：main
//备   注：先写从机地址 
//============================================================================
int readDWord(int addr,unsigned  long *data);
//==============================================================================
//函数名称：int readByte(int addr, char *data)
//输入参数：addr :读取的地址  *data 读取数据存放地址
//输出参数：0：失败 1：成功
//功能说明：读取单个字节数据
//调用位置：main
//备   注：先写从机地址 
//============================================================================
int readArrayData(int addr,unsigned  char *data,unsigned int length);

//==============================================================================
//函数名称：int readByte(int addr, char *data)
//输入参数：addr :读取的地址  *data 读取数据存放地址
//输出参数：0：失败 1：成功
//功能说明：读取单个字节数据
//调用位置：main
//备   注：先写从机地址 
//============================================================================
void clr_FM24C64(void);
#endif