//*****************************Copyright(c)************************************* 
//** 公      司：         AMAE 
//** 项      目：         ADS130    
//** 硬件版本号：       
//**================================================================== 
//**------------------------------------ 文件信息-------------------------------
//** 文  件 名:      eeprom.c
//** 文件 描述:      与外部eeprom通讯的处理函数接口
//** 版     本:      v0.1
//** 创  建 人:      苏琴
//** 创建 日期:      2012.8.29
//**============================================================================
//头文件
//=============================================================================
#ifndef _EEPROM_H_
#define _EEPROM_H_


#include "display.h"
//==============================================================================
//函数名称：void eeprom_ReadMod(void)
//输入参数：void
//输出参数：void
//功能说明：读取设置模式
//调用位置：
//备   注：
//============================================================================
void eeprom_ReadMod(void);
//==============================================================================
//函数名称：void eeprom_WriteMod(void)
//输入参数：void
//输出参数：void
//功能说明：写设置模式
//调用位置：
//备   注：
//============================================================================
void eeprom_WriteMod(unsigned char mod);
//==============================================================================
//函数名称：void eeprom_ReadManuSetPara(void)
//输入参数：void
//输出参数：void
//功能说明：读取手动参数
//调用位置：
//备   注：
//============================================================================
void eeprom_ReadManuSetPara(void);

//==============================================================================
//函数名称：void eeprom_WriteManuSetPara(void)
//输入参数：void
//输出参数：void
//功能说明：写手动参数
//调用位置：
//备   注：
//============================================================================
void eeprom_WriteManuSetPara(MANU val);
//==============================================================================
//函数名称：void eeprom_ReadGroupSetPara(char num)
//输入参数：num:组号
//输出参数：void
//功能说明：读取定时采样参数
//调用位置：main
//备   注：
//============================================================================
void eeprom_ReadGroupSetPara(char num);
//==============================================================================
//函数名称：void eeprom_ReadGroupSetPara(char num)
//输入参数：num:组号
//输出参数：void
//功能说明：读取定时采样参数
//调用位置：main
//备   注：
//============================================================================
void eeprom_WriteGroupSetPara(GROUP val,char num);
//==============================================================================
//函数名称：void eeprom_ReadCylsSetPara(void)
//输入参数：void
//输出参数：void
//功能说明：读取循环采样参数
//调用位置：main
//备   注：
//============================================================================
void eeprom_ReadCylsSetPara(void);
//==============================================================================
//函数名称：void eeprom_ReadCylsSetPara(void)
//输入参数：void
//输出参数：void
//功能说明：写循环采样参数
//调用位置：main
//备   注：
//============================================================================
void eeprom_WriteCylsSetPara(CYL var);
//==============================================================================
//函数名称：void eeprom_ReadCapSetPara(void)
//输入参数：void
//输出参数：void
//功能说明：读取定容采样参数
//调用位置：main
//备   注：
//============================================================================
void eeprom_ReadCapSetPara(void);
//==============================================================================
//函数名称：void eeprom_WriteCapSetPara(void)
//输入参数：void
//输出参数：void
//功能说明：写定容采样参数
//调用位置：main
//备   注：
//============================================================================
void eeprom_WriteCapSetPara(CLV var);
//==============================================================================
//函数名称：void readAllReviewData(unsigned char num)
//输入参数：num:下标
//输出参数：void
//功能说明：
//调用位置：
//备   注：
//============================================================================
void readAllReviewData(unsigned char num);
//==============================================================================
//函数名称：void writeReviewData(unsigned char num)
//输入参数：num:存储下标
//输出参数：void
//功能说明：存储采样数据
//调用位置：
//备   注：
//============================================================================
void writeReviewData(unsigned char num);
void readReviewNum(void);
void writeReviewNum(void);
#endif