


//*****************************Copyright(c)************************************* 
//** 公      司：         AMAE 
//** 项      目：         ADS130    
//** 硬件版本号：       
//**================================================================== 
//**------------------------------------ 文件信息-------------------------------
//** 文  件 名:      bmp085.h
//** 文件 描述:      接收数字压力传感器的温度
//** 版     本:      v0.1
//** 创  建 人:      苏琴
//** 创建 日期:      2012.9.17
//**============================================================================
#ifndef _BMP085_H
#define _BMP085_H

typedef struct BMP085_PARAMETER
{
	int ac1;
	int ac2; 
	short ac3; 
	unsigned int ac4;
	unsigned int ac5;
	unsigned int ac6;
	int b1; 
	int b2;
	int mb;
	int mc;
	int md;
}BMP085_PARAMETER;
//==============================================================================
//函数名称：int read_Bmp085_Cali(void)
//输入参数：void
//输出参数：0：读失败  非0：读成功
//功能说明：读取校准值数据
//调用位置：
//备   注：
//============================================================================
unsigned char check_press_trans(void);
//==============================================================================
//函数名称：unsigned char bmp085_ReadWord( unsigned char addr,unsigned int *data)
//输入参数：addr：寄存器地址 data：读取数据
//输出参数：0：读失败  非0：读成功
//功能说明：读单个字节数据
//调用位置：
//备   注：
//============================================================================
unsigned int bmp085_read_word( unsigned char addr);

//==============================================================================
//函数名称：int bmp085_ReadByte(unsigned char addr,unsigned char *data)
//输入参数：addr：寄存器地址 data：读取数据
//输出参数：0：读失败  非0：读成功
//功能说明：读单个字节数据
//调用位置：
//备   注：
//============================================================================
unsigned char bmp085_read_byte(unsigned char addr,unsigned char *data);
//==============================================================================
//函数名称：int bmp085_WriteByte(unsigned char saddr  unsigned char addr,unsigned char data)
//输入参数：saddr 命令 addr：寄存器地址 data：写入数据
//输出参数：0：写失败  非0：写成功
//功能说明：写单个字节数据
//调用位置：
//备   注：
//============================================================================
unsigned int bmp085_read_word( unsigned char addr);
void init_bmp085(void);
void bmp085_start(void);                //重启BMP085芯片

//==============================================================================
//函数名称：long read_Bmp085_Temp(void)
//输入参数：void
//输出参数：当前温度采样值
//功能说明：读取未校准温度值
//调用位置：
//备   注：
//============================================================================
void pressTask(void);
#endif