
/**************************************Copyright(@CTI)**************************
**程序  名:    menu.h
**公司  名:    深圳华测检测技术股份有限公司（CTI）
**程序功能:    实现单片机的时钟初始化函数，延时函数
**创建  人:    陈世培
**日    期：   2010.12.29
**说    明:    包含菜单结构体的声明，菜单初始化函数的声明等
**            
**注    意：   
********************************************************************************/ 

#ifndef _MENU_H_

#define _MENU_H_


struct MENU                  //菜单结构体
{
  struct MENU *topMenu;      //菜单的上层菜单指针
  struct MENU *subMenu;      //菜单的子菜单指针


  struct MENU *rMenu;        //菜单的右伙伴菜单指针
  struct MENU *lMenu;        //菜单的做伙伴菜单指针

 // unsigned char x;           //菜单坐标的x值
  //unsigned char y;           //菜单坐标的y值

 // char*  text;               //菜单文本

  long status1;               //菜单内部辅助量1
  int status2;               //菜单内部辅助量2
  unsigned char count;


  void (*onUp)(void);        // 上键处理函数指针
  void (*onDown)(void);      // 下键处理函数指针
  void (*onLeft)(void);      // 左键处理函数指针
  void (*onRight)(void);     // 右键处理函数指针

  void (*onOk)(void);        // ok键处理函数指针
  void (*longOnOk)(void);    // 长按ok键处理函数指针

  void (*onEsc)(void);       // Esc键处理函数指针

  void (*show)(void);        // 显示函数

  void (*menuExec)(void);    // 要循环执行得函数
};





/**************************************************************************
**函数名称:      extern struct MENU* newMenu
**功    能:          建立菜单结构体函数，主要完成从堆里给菜单结构体分配内存，并
                 初始化结构体里的值
**参    数:      void
**返 回 值:      struct MENU* 返回指向菜单结构体的指针
**注    意：     
***************************************************************************/
extern struct MENU* newMenu(void);     //新建菜单结构体函数

void freeAllMenu(void);  //释放本模块里分配胡所有菜单




/**************************************************************************
**函数名称:      static void initMenu
**功    能:      在给分配内存给菜单时对菜单进行初始化，使其成员有一个合适的值
**参    数:      menu指针传入需要设置的菜单的指针
**返 回 值:      void
**注    意：     
***************************************************************************/
static void initMenu(struct MENU *menu);   //出示化菜单函数









/**************************************************************************
**函数名称:      extern void connectUpKey
**功    能:      实现连接菜单的上键处理函数
**参    数:      menu 为需要连接的菜单的指针，
                 keyfun 为相应的按键处理函数
**返 回 值:      void
**注    意：     
***************************************************************************/
extern void connectUpKey(struct MENU *menu,void (*keyfun)(void));  





/**************************************************************************
**函数名称:      extern void connectDownKey
**功    能:      连接菜单的下键处理函数
**参    数:      menu 为需要连接的菜单指针
                 keyfun 为需要连接的按键处理函数
**返 回 值:      void
**注    意：     
***************************************************************************/
extern void connectDownKey(struct MENU *menu,void (*keyfun)(void)); 






/**************************************************************************
**函数名称:      extern void connectLeftKey
**功    能:      连接菜单左键处理函数
**参    数:      menu 为需要连接的菜单
                 keyfun为需要连接的函数
**返 回 值:      void
**注    意：     
***************************************************************************/
extern void connectLeftKey(struct MENU *menu,void (*keyfun)(void));





/**************************************************************************
**函数名称:      extern void connectRightKey
**功    能:      连接菜单右键处理函数
**参    数:      menu 为需要连接的菜单
                 keyfun 为需要连接的右键处理函数
**返 回 值:      void
**注    意：     
***************************************************************************/
extern void connectRightKey(struct MENU *menu,void (*keyfun)(void)); 







/**************************************************************************
**函数名称:      extern void connectOkKey
**功    能:      连接菜单的OK键处理函数
**参    数:      menu 为需要连接的菜单指针
                 keyfun为需要连接的Ok键处理函数
**返 回 值:      void
**注    意：     
***************************************************************************/
extern void connectOkKey(struct MENU *menu,void (*keyfun)(void));    









/**************************************************************************
**函数名称:      extern void connectEscKey
**功    能:      连接菜单的Esc键处理函数
**参    数:      menu 为需要连接的菜单结构体
                 keyfun为需要连接的Esc键处理函数
**返 回 值:      void
**注    意：     
***************************************************************************/
extern void connectEscKey(struct MENU *menu,void (*keyfun)(void));   




/**************************************************************************
**函数名称:      extern void connectLongOkKey
**功    能:        连接菜单的长按  OK 键处理函数
**参    数:        menu 为需要连接的菜单指针
                keyfun为需要连接的Ok键处理函数
**返 回 值:       void
**注    意：
***************************************************************************/
extern void connectLongOkKey( struct MENU *menu, void (*keyfun)(void) );







/**************************************************************************
**函数名称:      extern void connectShowfun
**功    能:      连接菜单的显示函数
**参    数:      menu 为需要连接的菜单
                 showfun 为需要连接的显示函数
**返 回 值:      void
**注    意：     
***************************************************************************/
extern void connectShowfun(struct MENU *menu,void (*showfun)(void));





/**************************************************************************
**函数名称:      extern void connectExec
**功    能:      连接菜单Exec函数的函数
**参    数:      menu 为需要连接的菜单
                 execFun 为需要连接的Exec函数
**返 回 值:      void
**注    意：     
***************************************************************************/
extern void connectExec(struct MENU *menu,void (*execFun)(void));




/**************************************************************************
**函数名称:      extern void  connectMenu
**功    能:         实现两个菜单的互连，当两个独立的菜单连接时形成一个循环链表，
                 如果lMenu菜单已经有伙伴菜单，那么将断开其节点，将rMenu舔到循环
                 链表中，重新闭合形成一个循环链表。
**参    数:      lMenu 为需要连接的左菜单
                 rMenu 为需要连接的右菜单
**返 回 值:      void
**注    意：     
***************************************************************************/
extern void connectMenu(struct MENU *lMenu,struct MENU *rMenu); 





/**************************************************************************
**函数名称:      extern void  addSubMenu
**功    能:          使topMenu所指向的菜单添加一个由subMenu指向的菜单作为其下层
                 菜单。使subMenu所指向的菜单的所有伙伴菜单的父菜单为topMenu

**参    数:      topMenu为要设置的上层菜单，subMenu为要连接的下层菜单
**返 回 值:      void
**注    意：     
***************************************************************************/
extern void addSubMenu(struct MENU *topMenu,struct MENU *subMenu);  






/**************************************************************************
**函数名称:      static void defaultKeyfun
**功    能:      默认的菜单按键处理函数
**参    数:      void
**返 回 值:      void
**注    意：     
***************************************************************************/
static void defaultKeyfun(void);    





#endif

